{
    "text.chatpatches.title": "Configuration de Chat Patches",
  
    "text.chatpatches.date_format": "Pour des informations sur le formatage des dates et heures, cliquez ici !",
    "text.chatpatches.format_codes": "Pour les caractères de code de formatage et leurs utilisations, cliquez ici !",
    "text.chatpatches.faq": "Pour les questions fréquemment posées (FAQ), cliquez ici !",
    "text.chatpatches.regex": "Pour des informations sur les expressions régulières, cliquez ici !",
    "text.chatpatches.regex_tester": "Pour tester les expressions régulières, cliquez ici !",

    "text.chatpatches.time": "Activer l'horodatage",
    "text.chatpatches.timeDate": "Texte de l'horodatage",
    "text.chatpatches.timeFormat": "Texte de décoration de l'horodatage",
    "text.chatpatches.timeColor": "Couleur de l'horodatage",
    "text.chatpatches.desc.time": "Afficher un horodatage devant tous les messages ?",
    "text.chatpatches.desc.timeDate": "Le texte qui est formaté en une horodatage.",
    "text.chatpatches.desc.timeFormat": "La chaîne de caractères de modificateurs de code de formatage ('&') et de texte de décoration qui créent l'horodatage. Le caractère '$' est un espace réservé pour l'horodatage formaté, au-dessus de cette option.",
    "text.chatpatches.desc.timeColor": "La couleur qui est utilisée là où elle serait autrement vide dans l'horodatage final. Pour l'utiliser avec d'autres modificateurs de formatage, utilisez '&r' dans l'option de texte de décoration.",

    "text.chatpatches.hover": "Activer le survol",
    "text.chatpatches.hoverDate": "Texte de survol",
    "text.chatpatches.hoverFormat": "Texte de décoration du survol",
    "text.chatpatches.hoverColor": "Couleur du texte de survol",
    "text.chatpatches.desc.hover": "Afficher un texte indiquant une description plus détaillée de l'heure lorsque vous survolez le texte de l'horodatage dans le chat ?",
    "text.chatpatches.desc.hoverDate": "Le texte qui est formaté en une chaîne plus longue pour la date et l'heure.",
    "text.chatpatches.desc.hoverFormat": "La chaîne de caractères de modificateurs de code de formatage ('&') et de texte de décoration qui créent la description détaillée lors du survol. Requiert un espace réservé ('$') pour l'horodatage formaté, au-dessus de cette option.",
    "text.chatpatches.desc.hoverColor": "La couleur qui est utilisée là où elle serait autrement blanc vide dans le texte de survol final. Pour l'utiliser avec d'autres modificateurs de formatage, utilisez '&r' dans l'option de texte de décoration.",

    "text.chatpatches.counter": "Activer le compteur de messages",
    "text.chatpatches.counterFormat": "Texte du compteur de messages",
    "text.chatpatches.counterColor": "Couleur du compteur de messages",
    "text.chatpatches.desc.counter": "Afficher un compteur de messages après les messages pour indiquer qu'il y a eu plusieurs doublons envoyés ?",
    "text.chatpatches.desc.counterFormat": "Le texte qui est ajouté à la fin d'un message pour indiquer qu'il y a eu plusieurs doublons envoyés. Requiert un espace réservé ('$') pour le nombre de doublons, prend également en charge les modificateurs de code de formatage ('&').",
    "text.chatpatches.desc.counterColor": "La couleur qui est utilisée là où elle serait autrement blanc vide dans le compteur de doublons final. Pour l'utiliser avec d'autres modificateurs de formatage, utilisez '&r' dans l'option de texte de décoration.",

    "text.chatpatches.boundary": "Activer la ligne de séparation",
    "text.chatpatches.boundaryFormat": "Texte de la ligne de séparation",
    "text.chatpatches.boundaryColor": "Couleur de la ligne de séparation",
    "text.chatpatches.desc.boundary": "Afficher une ligne de séparation après avoir discuté, quitté un monde/un serveur, puis rejoint un autre monde/un autre serveur plus tard ?",
    "text.chatpatches.desc.boundaryFormat": "Le texte qui est formaté et utilisé pour la ligne de séparation. Prend en charge les modificateurs de code de formatage ('&'), '\\n' pour les nouvelles lignes et utilise le caractère '$' comme espace réservé pour le nom du monde.",
    "text.chatpatches.desc.boundaryColor": "La couleur qui est utilisée là où elle serait autrement blanc vide dans la ligne de séparation finale. Pour l'utiliser avec d'autres modificateurs de formatage, utilisez '&r' dans l'option de texte de décoration.",

    "text.chatpatches.saveChat": "Activer l'enregistrement du chat",
    "text.chatpatches.shiftChat": "Décaler le chat",
    "text.chatpatches.chatWidth": "Remplacer la largeur du chat",
    "text.chatpatches.maxMsgs": "Nombre maximal de messages du chat",
    "text.chatpatches.nameFormat": "Texte du nom du joueur",
    "text.chatpatches.messageDrafting": "Activer la sauvegarde des brouillons de chat",
    "text.chatpatches.searchDrafting": "Activer la sauvegarde des brouillons de recherche",
    "text.chatpatches.hideSearchButton": "Masquer le bouton de recherche",
    "text.chatpatches.desc.saveChat": "Le chat doit-il être enregistré dans un journal pour pouvoir être réintégré dans le chat lors d'une autre session de jeu ?",
    "text.chatpatches.desc.shiftChat": "Décale l'interface du chat vers le haut pour ne pas gêner la barre d'armure et/ou la santé. La valeur par défaut est 10, mettez 0 pour ne pas décaler.",
    "text.chatpatches.desc.chatWidth": "La largeur de la fenêtre de chat. Cela remplace la valeur par défaut de Minecraft et permet une largeur beaucoup plus grande. Mettez 0 pour utiliser les réglages par défaut de Minecraft sans les remplacer.",
    "text.chatpatches.desc.maxMsgs": "Le nombre maximal de messages du chat autorisés à être enregistrés. Minecraft le limite à 100, ce mod peut l'augmenter jusqu'à 32 767. Gardez à l'esprit que plus le nombre maximal est élevé, plus la mémoire utilisée est importante.",
    "text.chatpatches.desc.nameFormat": "Le texte qui remplace le nom du joueur dans les messages du chat. La valeur par défaut est '<$>', où '$' est un espace réservé pour le nom du joueur. S'applique uniquement aux messages envoyés par les joueurs.",
    "text.chatpatches.desc.messageDrafting": "Le texte dans le champ de chat doit-il persister après avoir fermé et rouvert le chat ?",
    "text.chatpatches.desc.searchDrafting": "Le texte dans le champ de recherche doit-il persister après avoir fermé et rouvert le chat ?",
    "text.chatpatches.desc.hideSearchButton": "Le bouton de recherche doit-il être masqué ? Notez que cela désactive toutes les fonctionnalités de recherche.",

    "text.chatpatches.category.time": "Horodatage",
    "text.chatpatches.category.hover": "Informations de survol",
    "text.chatpatches.category.counter": "Compteur de doublons",
    "text.chatpatches.category.boundary": "Ligne de séparation de session",
    "text.chatpatches.category.chat": "Interface de chat",
    "text.chatpatches.category.help": "Aide",
    "text.chatpatches.category.debug": "Débogage",

    "text.chatpatches.copymessage.index": "Message copié %d : '%s'",
    "text.chatpatches.copymessage.index.missing": "Le message %d n'existe pas",

    "text.chatpatches.searchSuggestion": "Rechercher...",
    "text.chatpatches.search.caseSensitive": "Sensible à la casse",
    "text.chatpatches.search.modifiers": "Modificateurs",
    "text.chatpatches.search.regex": "Expression régulière",
    "text.chatpatches.search.desc": "§bClic gauche§r pour activer/désactiver la barre de recherche, ou §dcli droit§r pour ouvrir le menu des paramètres.\n\n§aVert§r signifie qu'une correspondance a été trouvée, §ejaune§r signifie qu'aucune correspondance n'a été trouvée et §cré§r signifie que la recherche est invalide.",
    "text.chatpatches.search.desc.caseSensitive": "La recherche doit-elle correspondre uniquement au texte ayant la même casse ?\n\n\"abc\" correspondrait à lui-même, \"Abc\" et \"ABC\" ; avec la sensibilité à la casse, cela correspondrait uniquement à \"abc\".\n§l§oREMARQUE :§r Cela s'applique également à la recherche avec expressions régulières.",
    "text.chatpatches.search.desc.modifiers": "La recherche doit-elle autoriser la correspondance du texte en fonction des modificateurs de formatage ?\n\n\"abc\" correspondrait à \"abc\" et \"§e§labc§r\" ; avec les modificateurs, cela ne correspondrait qu'à \"§e§labc§r\".\nREMARQUE : Les couleurs hexadécimales §opeuvent§r être correspondantes au format \"&#§cRR§aGG§9BB§r\", cependant, §ncela est en version bêta§f.",
    "text.chatpatches.search.desc.regex": "La recherche doit-elle être utilisée comme une §2express§rion §2rég§rulière ?\n\nPour apprendre à utiliser les expressions régulières, consultez la section d'aide de la configuration.\n§l§oREMARQUE :§r Les expressions régulières Java §nn'acceptent PAS§f le remplacement dans les recherches. Cela s'applique également aux recherches avec des modificateurs de formatage activés."
}
